<?xml version="1.0"?>
<net name="Model14" version="11">
	<layers>
		<layer id="3" name="input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="position_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="position_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="beam_idx" type="Parameter" version="opset1">
			<data shape="?" element_type="i32" />
			<output>
				<port id="0" precision="I32" names="beam_idx">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Constant_534872" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="5" name="ShapeOf_534832" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Constant_534834" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Constant_534836" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="8" name="Gather_534837" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="146">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Constant_534865" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="12" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Constant_534867" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Constant_534869" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="20" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Concat_534870" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Broadcast_534873" type="Broadcast" version="opset3">
			<data mode="numpy" />
			<input>
				<port id="0" precision="FP32" />
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>0</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="ReadValue_530819" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.9.valuepresent.9.value" variable_type="f32" variable_shape="?,12,?,64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>0</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.9.value">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_526748" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="16" name="Gather_526749" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Constant_507278" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="28" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Constant_507266" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="9244" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Constant_507265" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="12316" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_507253" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="21532" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Constant_507252" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="24604" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_507240" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="33820" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Constant_507239" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="36892" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Constant_507227" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="46108" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Constant_507226" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="49180" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Constant_507214" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="58396" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Constant_507213" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="61468" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_507201" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="70684" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Constant_507200" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="73756" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_507188" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="82972" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Constant_507187" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="86044" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Constant_507175" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="95260" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Constant_507174" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="98332" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Constant_507162" type="Const" version="opset1">
			<data element_type="f32" shape="1, 768" offset="107548" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Constant_507158" type="Const" version="opset1">
			<data element_type="f32" shape="1, 2304" offset="110620" size="9216" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="self.model.transformer.wte.weight" type="Const" version="opset1">
			<data element_type="f32" shape="50257, 768" offset="119836" size="154389504" />
			<output>
				<port id="0" precision="FP32" names="self.model.transformer.wte.weight">
					<dim>50257</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="__module.model.transformer/prim::ListConstruct/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="154509340" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="__module.model.transformer/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="145,input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="__module.model.transformer.wte/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="__module.model.transformer.wte/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="41" name="__module.model.transformer.wte/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>50257</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="157,inputs_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="self.model.transformer.wpe.weight" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 768" offset="154509356" size="3145728" />
			<output>
				<port id="0" precision="FP32" names="self.model.transformer.wpe.weight">
					<dim>1024</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="__module.model.transformer.wpe/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.transformer.wpe/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="45" name="__module.model.transformer.wpe/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="159,position_embeds">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.transformer/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="160,input.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.transformer.h.0.ln_1/aten::layer_norm/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="157655084" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.model.transformer.h.0.ln_1/aten::layer_norm/MVN" type="MVN" version="opset6">
			<data eps="9.9999997473787516e-06" normalize_variance="true" eps_mode="INSIDE_SQRT" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Constant_507156" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="157655088" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.transformer.h.0.ln_1/aten::layer_norm/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Constant_507157" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 768" offset="157658160" size="3072" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="__module.model.transformer.h.0.ln_1/aten::layer_norm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="170,x.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Constant_563495" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="157661232" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="ShapeOf_563491" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="157661240" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Constant_563492" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="157661232" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_563493" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="57" name="Gather_563494" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Concat_563496" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.transformer.h.0.attn.c_attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="180">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Transpose_505852" type="Const" version="opset1">
			<data element_type="f32" shape="2304, 768" offset="157661256" size="7077888" />
			<output>
				<port id="0" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.transformer.h.0.attn.c_attn/aten::addmm/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>2304</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.transformer.h.0.attn.c_attn/aten::addmm/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="181,x.3">
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.transformer.h.0.attn.c_attn/aten::size/ShapeOf_1" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Constant_499917" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="164739144" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Constant_499918" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="66" name="Gather_499919" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.transformer.h.0.attn.c_attn/prim::ListConstruct/Reshape_1" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="164739160" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.transformer.h.0.attn.c_attn/prim::ListConstruct/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="182">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.model.transformer.h.0.attn.c_attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="183">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="86" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="164739168" size="8" />
			<output>
				<port id="0" precision="I64" names="86" />
			</output>
		</layer>
		<layer id="71" name="__module.model.transformer.h.0.attn/prim::ListUnpack/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="164739176" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="__module.model.transformer.h.0.attn/prim::ListUnpack/VariadicSplit" type="VariadicSplit" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>2304</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32" names="185,tensor.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="4" precision="FP32" names="186,tensor.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="5" precision="FP32" names="187,tensor.9">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="__module.model.transformer.h.0.attn/prim::ListConstruct/Concat" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="164739200" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="__module.model.transformer.h.0.attn/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="191,tensor.3">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Constant_461402" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="164739232" size="32" />
			<output>
				<port id="0" precision="I64" names="192">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="__module.model.transformer.h.0.attn/aten::permute/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="193,query.1">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="ReadValue_530773" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.0.keypresent.0.key" variable_type="f32" variable_shape="?,12,?,64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>0</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.0.key">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Constant_526691" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="79" name="Gather_526692" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.model.transformer.h.0.attn/prim::ListConstruct/Concat_1" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="164739200" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.transformer.h.0.attn/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="197,tensor.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Constant_461421" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="164739232" size="32" />
			<output>
				<port id="0" precision="I64" names="198">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="__module.model.transformer.h.0.attn/aten::permute/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="199">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="__module.model.transformer.h.0.attn/aten::cat/Concat" type="Concat" version="opset1">
			<data axis="-2" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.0.key">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="ReadValue_530775" type="ReadValue" version="opset6">
			<data variable_id="past_key_values.0.valuepresent.0.value" variable_type="f32" variable_shape="?,12,?,64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>0</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="past_key_values.0.value">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Constant_526694" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="87" name="Gather_526695" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="__module.model.transformer.h.0.attn/prim::ListConstruct/Concat_2" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="164739200" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="__module.model.transformer.h.0.attn/aten::view/Reshape_2" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="203,tensor.11">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Constant_461440" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="164739232" size="32" />
			<output>
				<port id="0" precision="I64" names="204">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="__module.model.transformer.h.0.attn/aten::permute/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>12</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="205">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.transformer.h.0.attn/aten::cat/Concat_1" type="Concat" version="opset1">
			<data axis="-2" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="present.0.value">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.model.transformer.h.0.attn/aten::slice/Slice" type="Const" version="opset1">
			<data element_type="boolean" shape="1, 1, 1024, 1024" offset="164739264" size="1048576" />
			<output>
				<port id="0" precision="BOOL" names="220">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Constant_502426" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="165787840" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Constant_502425" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="164739168" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="ShapeOf_509623" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="Constant_509624" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="164739168" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="98" name="Constant_509625" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="99" name="Gather_509626" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" />
			</output>
		</layer>
		<layer id="100" name="__module.model.transformer/aten::size/ShapeOf_2" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>768</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_509628" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="165787864" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="102" name="Constant_509629" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="103" name="Gather_509630" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="1116,1245,1374,1503,1632,213,342,471,600,729,858,987" />
			</output>
		</layer>
		<layer id="104" name="Add_509631" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="215" />
			</output>
		</layer>
		<layer id="105" name="__module.model.transformer.h.0.attn/aten::sub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="217,218" />
			</output>
		</layer>
		<layer id="106" name="Constant_559435" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="157661232" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.model.transformer.h.0.attn/aten::slice/Unsqueeze" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Constant_502424" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="0" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="ScatterUpdate_502427" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_502428" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="165787840" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_559436" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="157661232" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.transformer.h.0.attn/aten::slice/Unsqueeze_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64" />
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="ScatterUpdate_502429" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Constant_502432" type="Const" version="opset1">
			<data element_type="i64" shape="3" offset="165787872" size="24" />
			<output>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="__module.model.transformer.h.0.attn/aten::slice/Slice_1" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 0" end_mask="1, 1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
				<port id="2" precision="I64">
					<dim>3</dim>
				</port>
				<port id="3" precision="I64">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="BOOL" names="221">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="Constant_502505" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="165787896" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="Constant_502506" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="165787896" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="Constant_502502" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="165787928" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="Constant_502501" type="Const" version="opset1">
			<data element_type="i32" shape="1" offset="0" size="4" />
			<output>
				<port id="0" precision="I32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="ScatterUpdate_502507" type="ScatterUpdate" version="opset3">
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64">
					<dim>1</dim>
				</port>
				<port id="3" precision="I32">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="Constant_502510" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="165787936" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.model.transformer.h.0.attn/aten::slice/Slice_2" type="StridedSlice" version="opset1">
			<data begin_mask="1, 1, 1, 0" end_mask="1, 1, 1, 0" new_axis_mask="" shrink_axis_mask="" ellipsis_mask="" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
				<port id="2" precision="I64">
					<dim>4</dim>
				</port>
				<port id="3" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="BOOL" names="222,223">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.model.transformer.h.0.attn/aten::where/Convert_1" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="124" name="__module.model.transformer.h.0.attn/aten::full/Convert" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="165787968" size="4" />
			<output>
				<port id="0" precision="FP32" names="212" />
			</output>
		</layer>
		<layer id="125" name="__module.model.transformer.h.0.attn/aten::where/Select" type="Select" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="224,causal_mask.1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="Constant_507160" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="165787972" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="__module.model.transformer/prim::ListConstruct/Reshape" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="157661232" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="__module.model.transformer/prim::ListConstruct/Concat_1" type="Concat" version="opset1">
			<data axis="0" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="147">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="__module.model.transformer/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="false" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="148,149,attention_mask.3">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Constant_509577" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="165787976" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="__module.model.transformer/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="151,152,attention_mask.5">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="__module.model.transformer/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="153">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="Constant_507159" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="165787972" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="__module.model.transformer/aten::rsub/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="__module.model.transformer/aten::rsub/Subtract" type="Subtract" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="154">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="Constant_507161" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="165787968" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="__module.model.transformer/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="155,attention_mask">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Add_504408" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="ShapeOf_504409" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="ShapeOf_509703" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>12</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="Constant_509704" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="4" size="8" />
			<output>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="142" name="Constant_509705" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="4" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="143" name="Gather_509706" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
				<port id="2" precision="I64" />
			</input>
			<output>
